       01  REGISTRO.
           05 REG-AGENCIA              PICTURE X(04).
           05 REG-CONTA                PICTURE X(05).
           05 REG-NOME                 PICTURE X(30).
           05 REG-GERENTE              PICTURE X(03).
           05 REG-TIPO-CONTA           PICTURE 9(01).
           05 REG-SALDO                PICTURE 9(10)V99.
      *    LAYOUT = 55 POSICOES 
