       IDENTIFICATION DIVISION.
       PROGRAM-ID. OLACOBOL.
       PROCEDURE DIVISION.
           DISPLAY "Hello, World!"
           STOP RUN.
       