       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-CATEGORIA            PIC 9.
       01  WS-NOME-PROJETO         PIC X(20).
       01  WS-VALOR-PROJETO        PIC 9(05)V99.
       PROCEDURE DIVISION.

       DISPLAY "DIGITE NOME DO PROJETO".
       ACCEPT WS-NOME-PROJETO.

       DISPLAY "ESCOLHA A CATEGORIA DO PROJETO:".
       DISPLAY "  1 - DESENVOLVIMENTO WEB".
       DISPLAY "  2 - DESIGN GRAFICO".
       DISPLAY "  3 - OUTRO".
       ACCEPT WS-CATEGORIA.

       DISPLAY "INFORME O VALOR DO PROJETO".
       ACCEPT WS-VALOR-PROJETO.

       IF  WS-VALOR-PROJETO GREATER THAN 1000 AND 
           (WS-CATEGORIA EQUALS 1 OR WS-CATEGORIA EQUALS 2) THEN 
           DISPLAY WS-NOME-PROJETO
           DISPLAY WS-VALOR-PROJETO
       ELSE 
           EVALUATE TRUE

               WHEN WS-VALOR-PROJETO LESS THAN 1000
                   DISPLAY "PROJETO ABAIXO DE 1.000,00"

               WHEN WS-CATEGORIA GREATER THAN 2
                   DISPLAY "ESSA CATEGORIA NAO INTERESSA A NOS"
           END-EVALUATE 
       END-IF 

       STOP RUN.


           
      


